import { v4 as uuidv4 } from "uuid";

export const works = [
  {
    company: "Dr.Web",
    link: "https://www.drweb.ru",
    key: "drweb",
    position: "Frontend-разработчик",
    tasks: [
      "- Участие в разработке новых проектов;",
      "- Модификация и расширение существующего функционала;",
      "- Разработка и развитие внутренней библиотеки компонентов;",
      "- Участие в планировании и оценке задач;",
      "- Верстка одностраничных landing pages;",
    ],
    uuid: uuidv4(),
  },
  {
    company: "Outside Digital",
    link: "https://outside.digital",
    key: "od",
    position: "Старший контент-менеджер",
    tasks: [
      "- Контент-поддержка ИТ продукта (веб-сервис);",
      "- Настройка и ведение процессов поддержки (актуализация базы знаний, FAQ, инструкции);",
      "- Участие в обучении пользователей работе с системой;",
      "- Взаимодействие с отделом разработки, постановка ТЗ;",
      "- Предложение roadmap по улучшению продукта и сервисов;",
    ],
    uuid: uuidv4(),
  },
  {
    company: "ERZ",
    link: "https://erzrf.ru/",
    key: "erz",
    position: "HTML-верстальщик",
    tasks: [
      "- Поддержка и развитие существующих проектов компании;",
      "- Кроссплатформенная, валидная адаптивная верстка;",
      "- Поиск и исправление багов;",
      "- Управление контентом на сайте компании;",
      "- Участие в оценке и планировании задач;",
    ],
    uuid: uuidv4(),
  },
  {
    company: "Vazaro",
    link: "https://www.vazaro.ru/",
    key: "vazaro",
    position: "Контент-менеджер",
    tasks: [
      "- Размещение контента на сайте компании;",
      "- Контроль и поддержка актуальности информации, размещенной на сайте;",
      "- Подготовка информационных текстов для сайта (рерайтинг);",
      "- Поиск и обработка изображений для размещения на сайте (Adobe Photoshop);",
      "- Постановка задач отделу разработки для исправления технических ошибок сайта;",
    ],
    uuid: uuidv4(),
  },
];
